AMI/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     foamRun;
solver          incompressibleFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1;
deltaT          1e-05;
adjustTimeStep  on;
maxCo           0.9;
writeControl    adjustableRunTime;
writeInterval   0.0001;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable on;

functions
{
    #includeFunc residuals(U,p,k,epsilon);
}