AMI/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-0.026 -0.026 -0.05)
  (0.05 -0.026 -0.05)
  (0.05 0.026 -0.05)
  (-0.026 0.026 -0.05)
  (-0.026 -0.026 0.065)
  (0.05 -0.026 0.065)
  (0.05 0.026 0.065)
  (-0.026 0.026 0.065)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (30 30 40) simpleGrading (1 1 1)
);
defaultPatch
{
  type patch;
}
boundary ();
