AMI/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  cadall.stl
  {
    type triSurfaceMesh;
    name cadall;
    regions
    {
      inner
      {
        name inner;
      }
      inlet
      {
        name inlet;
      }
      outlet
      {
        name outlet;
      }
      outer
      {
        name outer;
      }
    }
  }
  dynamicMeshCylinder0
  {
    type searchableCylinder;
    // Error epsilon is added/subtracted for stability.
    point1 (0.0 0.0 -0.05);
    point2 (0.0 0.0 0.041);
    radius 0.024;
  }
}
castellatedMeshControls
{
  features (
    {
      file "cadall.eMesh";
      level 3;
    }
  );
  refinementSurfaces
  {
    cadall
    {
      level (0 0);
      regions
      {
        inner
        {
          level (2 3);
          patchInfo
          {
            type wall;
          }
        }
        inlet
        {
          level (1 1);
          patchInfo
          {
            type patch;
          }
        }
        outlet
        {
          level (1 1);
          patchInfo
          {
            type patch;
          }
        }
        outer
        {
          level (2 3);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    dynamicMeshCylinder0
    {
      mode inside;
      level (2 3);
      cellZone dynamicMeshCellZone0;
      faceZone dynamicMeshFaceZone0;
    }
  }
  refinementRegions {}
  locationInMesh (0.0 0.0 0.059);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
