AMI/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    0;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.0 0.0 0.0);
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type fixedValue;
        value uniform (0 0 1);
    }
    wall
    {
        type movingWallVelocity;
        value uniform (0 0 0);
    }
    outlet
    {
        type zeroGradient;
    }
    bottom
    {
        type movingWallVelocity;
        value uniform (0 0 0);
    }
    rot
    {
        type movingWallVelocity;
        value uniform (0 0 0);
    }
    buffle0
    {
        type movingWallSlipVelocity;
        value uniform (0 0 0);
    }
    defaultFaces
    {
        type slip;
    }
}
