AMI/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      p;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.0;
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type zeroGradient;
    }
    wall
    {
        type zeroGradient;
    }
    outlet
    {
        type totalPressure;
        p0 uniform 0.0;
        value uniform 0.0;
    }
    bottom
    {
        type zeroGradient;
    }
    rot
    {
        type zeroGradient;
    }
    buffle0
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
