AMI/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      epsilon;
}
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type fixedValue;
        value uniform 0.01;
    }
    wall
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
    outlet
    {
        type zeroGradient;
    }
    bottom
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
    rot
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
    buffle0
    {
        type zeroGradient;
    }
    defaultFaces
    {
        type zeroGradient;
    }
}
