AMI/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
ddtSchemes{
  default Euler;
}
gradSchemes{
  default cellLimited Gauss linear 1;
}
divSchemes{
  default none;
  div(phi,U) bounded Gauss limitedLinearV 1;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
  div(phi,k) bounded Gauss limitedLinear 1;
  div(phi,epsilon) bounded Gauss limitedLinear 1;
}
laplacianSchemes{
  default Gauss linear corrected;
}
interpolationSchemes{
  default linear;
}
snGradSchemes{
  default corrected;
}
fluxRequired{
  default no;
  p;
}
