AMI/system/createNonConformalCouplesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      createNonConformalCouplesDict;
}
nonConformalCouple0
{
  patches (buffle0_primary buffle0_secondary);
  transform none;
}
